ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/EPWM6_EPWM.xml
	<register id="EPWM_REGS_CMPB" acronym="EPWM_REGS_CMPB" offset="0x14" width="16" description="Counter Compare B Register">
		<bitfield id="CMPB" width="16" begin="15" end="0" resetval="0x0" description="The value in the active CMPB register is continuously compared to the time-base counter [TBCNT] When the values are equal, the counter-compare module generates a time-base counter equal to counter compare B event This event is sent to the action-qualifier where it is qualified and converted it into one or more actions These actions can be applied to either the EPWMxA or the EPWMxB output depending on the configuration of the AQCTLA and AQCTLB registers The actions that can be defined in the AQCTLA and AQCTLB registers include the following [a] Do nothing, the event is ignored [b] Clear: Pull the EPWMxA and/or EPWMxB signal low [c] Set: Pull the EPWMxA and/or EPWMxB signal high [d] Toggle the EPWMxA and/or EPWMxB signal Shadowing of this register is enabled and disabled by the CMPCTL[SHDWBMODE] bit By default this register is shadowed [a] If CMPCTL[SHDWBMODE] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register In this case, the CMPCTL[LOADBMODE] bit field determines which event will load the active register from the shadow register: [b] Before a write, the CMPCTL[SHDWBFULL] bit can be read to determine if the shadow register is currently full [c] If CMPCTL[SHDWBMODE] = 1, then the shadow register is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware [d] In either mode, the active and shadow registers share the same memory map address " range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_AQCTLA" acronym="EPWM_REGS_AQCTLA" offset="0x16" width="16" description="Action Qualifier Control Register For Output A">
		<bitfield id="CBD" width="2" begin="11" end="10" resetval="0x0" description="Action when the time-base counter equals the active CMPB register and the counter is decrementing" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="CBU" width="2" begin="9" end="8" resetval="0x0" description="Action when the counter equals the active CMPB register and the counter is incrementing" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="CAD" width="2" begin="7" end="6" resetval="0x0" description="Action when the counter equals the active CMPA register and the counter is decrementing" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="CAU" width="2" begin="5" end="4" resetval="0x0" description="Action when the counter equals the active CMPA register and the counter is incrementing" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRD" width="2" begin="3" end="2" resetval="0x0" description="Action when the counter equals the period Note: By definition, in count up-down mode when the counter equals period the direction is defined as 0 or counting down" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="2" begin="1" end="0" resetval="0x0" description="Action when counter equals zero Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_AQCTLB" acronym="EPWM_REGS_AQCTLB" offset="0x18" width="16" description="Action Qualifier Control Register For Output B">
		<bitfield id="CBD" width="2" begin="11" end="10" resetval="0x0" description="Action when the counter equals the active CMPB register and the counter is decrementing" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="CBU" width="2" begin="9" end="8" resetval="0x0" description="Action when the counter equals the active CMPB register and the counter is incrementing" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="CAD" width="2" begin="7" end="6" resetval="0x0" description="Action when the counter equals the active CMPA register and the counter is decrementing" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="CAU" width="2" begin="5" end="4" resetval="0x0" description="Action when the counter equals the active CMPA register and the counter is incrementing" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="PRD" width="2" begin="3" end="2" resetval="0x0" description="Action when the counter equals the period Note: By definition, in count up-down mode when the counter equals period the direction is defined as 0 or counting down" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="2" begin="1" end="0" resetval="0x0" description="Action when counter equals zero Note: By definition, in count up-down mode when the counter equals 0 the direction is defined as 1 or counting up" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_AQSFRC" acronym="EPWM_REGS_AQSFRC" offset="0x1A" width="16" description="Action Qualifier Software Force Register">
		<bitfield id="RLDCSF" width="2" begin="7" end="6" resetval="0x0" description="AQCSFRC Active Register Reload From Shadow Options" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="OTSFB" width="1" begin="5" end="5" resetval="0x0" description="One-Time Software Forced Event on Output B" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="ACTSFB" width="2" begin="4" end="3" resetval="0x0" description="Action when One-Time Software Force B Is invoked" range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="OTSFA" width="1" begin="2" end="2" resetval="0x0" description="One-Time Software Forced Event on Output A" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="ACTSFA" width="2" begin="1" end="0" resetval="0x0" description="Action When One-Time Software Force A Is Invoked" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_AQCSFRC" acronym="EPWM_REGS_AQCSFRC" offset="0x1C" width="16" description="Action Qualifier Continuous S/W Force Register">
		<bitfield id="CSFB" width="2" begin="3" end="2" resetval="0x0" description="Continuous Software Force on Output B In immediate mode, a continuous force takes effect on the next TBCLK edge In shadow mode, a continuous force takes effect on the next TBCLK edge after a shadow load into the active register To configure shadow mode, use AQSFRC[RLDCSF]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="CSFA" width="2" begin="1" end="0" resetval="0x0" description="Continuous Software Force on Output A In immediate mode, a continuous force takes effect on the next TBCLK edge In shadow mode, a continuous force takes effect on the next TBCLK edge after a shadow load into the active register" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_DBCTL" acronym="EPWM_REGS_DBCTL" offset="0x1E" width="16" description="Dead-Band Generator Control Register">
		<bitfield id="IN_MODE" width="2" begin="5" end="4" resetval="0x0" description="Dead Band Input Mode Control Bit 5 controls the S5 switch and bit 4 controls the S4 switch This allows you to select the input source to the falling-edge and rising-edge delay To produce classical dead-band waveforms, the default is EPWMxA In is the source for both falling and rising-edge delays" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="POLSEL" width="2" begin="3" end="2" resetval="0x0" description="Polarity Select Control Bit 3 controls the S3 switch and bit 2 controls the S2 switch This allows you to selectively invert one of the delayed signals before it is sent out of the dead-band submodule The following descriptions correspond to classical upper/lower switch control as found in one leg of a digital motor control inverter These assume that DBCTL[OUT_MODE] = 1,1 and DBCTL[IN_MODE] = 0,0 Other enhanced modes are also possible, but not regarded as typical usage modes " range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="OUT_MODE" width="2" begin="1" end="0" resetval="0x0" description="Dead-band Output Mode Control Bit 1 controls the S1 switch and bit 0 controls the S0 switch This allows you to selectively enable or bypass the dead-band generation for the falling-edge and rising-edge delay" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_DBRED" acronym="EPWM_REGS_DBRED" offset="0x20" width="16" description="Dead-Band Generator Rising Edge Delay Count Register">
		<bitfield id="DEL" width="10" begin="9" end="0" resetval="0x0" description="Rising Edge Delay Count 10 bit counter" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="EPWM_REGS_DBFED" acronym="EPWM_REGS_DBFED" offset="0x22" width="16" description="Dead-Band Generator Falling Edge Delay Count Register">
		<bitfield id="DEL" width="10" begin="9" end="0" resetval="0x0" description="Falling Edge Delay Count 10 bit counter" range="9 - 0" rwaccess="R/W"/>
	</register>
